app/controllers/api/genres_controller.rb

    def index
        @genres = Genre.all
---
SELECT "genres".* FROM "genres"