Cineflix/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "FGZtt68wi4OXIQpcCY0i/A=="], ["updated_at", "2021-03-23 00:19:06.568107"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64
        self.save!